// 各种枚举映射

// 任务列表状态
export const TASKSTATUS = {
  '1':'已提交',
  '2':'退回',
  '3':'延期',
  '4':'进行中'
}

// 项目列表↓
// 软件类型
export const PROJECTMAP = {
  '1':'火箭飞控软件',
  '2':'综控器监控软件',
  '3':'GNCC软件',
  '4':'卫星星务',
  '5':'应用软件'
}
// 等级
export const LEVELMAP = {
  '1':'A级',
  '2':'B级',
  '3':'C级',
  '4':'D级'
}
// 开发语言
export const CODELANG = {
  '1':'C语言',
  '2':'FPGA',
  '3':'C++'
}
export const USERROLE = {
  '1':'需求分析工程师',
  '2':'需求评审工程师',
  '3':'仿真工程师',
  '4':'架构师',
  '5':'算法设计师',
  '6':'测试工程师',
  '7':'管理员'
}